In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 ={
    "name":['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "city":['rampur','kolkata','barilly','antarctica']
  }

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24     barilly
3   shubh     17  antarctica

In [6]:
df.to_csv('friends.csv')

In [8]:
df.tail(2)

     name  marks        city
2  skillf     24     barilly
3   shubh     17  antarctica

In [9]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [10]:
  df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [13]:
train = pd.read_csv('train.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'train.csv'

In [14]:
#create dataframe from list and dict
emp ={'email.id':[2,3,4,5,10],
     'name':['saloni','Anjali','gungun','divya','rohit'],
     'gender':['female','female','female','female','male'],
     'salary':[59000,34000,40000,60000,74000]
     }

In [15]:
df=pd.DataFrame(data=emp)

In [16]:
df

   email.id    name  gender  salary
0         2  saloni  female   59000
1         3  Anjali  female   34000
2         4  gungun  female   40000
3         5   divya  female   60000
4        10   rohit    male   74000

In [17]:
print(df)

   email.id    name  gender  salary
0         2  saloni  female   59000
1         3  Anjali  female   34000
2         4  gungun  female   40000
3         5   divya  female   60000
4        10   rohit    male   74000

In [18]:
#show all colums
print(df.columns)

Index(['email.id', 'name', 'gender', 'salary'], dtype='object')

In [19]:
df.head(3)

   email.id    name  gender  salary
0         2  saloni  female   59000
1         3  Anjali  female   34000
2         4  gungun  female   40000

In [22]:
df['name']

0    saloni
1    Anjali
2    gungun
3     divya
4     rohit
Name: name, dtype: object

In [24]:
df[df['email.id']==2]

   email.id    name  gender  salary
0         2  saloni  female   59000

In [29]:
df[df['email.id']==10]

   email.id   name gender  salary
4        10  rohit   male   74000

In [30]:
m=df[df['gender']=='male']
f=df[df['gender']=='female']

In [31]:
df[df['gender']=='male']

   email.id   name gender  salary
4        10  rohit   male   74000

In [34]:
df[['name','salary']]

     name  salary
0  saloni   59000
1  Anjali   34000
2  gungun   40000
3   divya   60000
4   rohit   74000

In [35]:
print('male')
print(m)
print('female')
print(f)

male
   email.id   name gender  salary
4        10  rohit   male   74000
female
   email.id    name  gender  salary
0         2  saloni  female   59000
1         3  Anjali  female   34000
2         4  gungun  female   40000
3         5   divya  female   60000

In [38]:
df.sort_values('salary',ascending =True)

   email.id    name  gender  salary
1         3  Anjali  female   34000
2         4  gungun  female   40000
0         2  saloni  female   59000
3         5   divya  female   60000
4        10   rohit    male   74000

In [39]:
help(df.sort_value)

AttributeError: 'DataFrame' object has no attribute 'sort_value'

In [40]:
print(df.index)

RangeIndex(start=0, stop=5, step=1)

In [41]:
df

   email.id    name  gender  salary
0         2  saloni  female   59000
1         3  Anjali  female   34000
2         4  gungun  female   40000
3         5   divya  female   60000
4        10   rohit    male   74000

In [44]:
df["salary"]>50000

0     True
1    False
2    False
3     True
4     True
Name: salary, dtype: bool

In [45]:
df[df["salary"]>50000]

   email.id    name  gender  salary
0         2  saloni  female   59000
3         5   divya  female   60000
4        10   rohit    male   74000

In [46]:
sp=df[df["salary"]>50000]
print(sp)

   email.id    name  gender  salary
0         2  saloni  female   59000
3         5   divya  female   60000
4        10   rohit    male   74000

In [47]:
sp=df[df["gender"]=="female"]
print(sp)

   email.id    name  gender  salary
0         2  saloni  female   59000
1         3  Anjali  female   34000
2         4  gungun  female   40000
3         5   divya  female   60000

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   email.id  5 non-null      int64
 1   name      5 non-null      object
 2   gender    5 non-null      object
 3   salary    5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [50]:
df.describe()

        email.id        salary
count   5.000000      5.000000
mean    4.800000  53400.000000
std     3.114482  16241.921069
min     2.000000  34000.000000
25%     3.000000  40000.000000
50%     4.000000  59000.000000
75%     5.000000  60000.000000
max    10.000000  74000.000000

In [51]:
df.describe(percentiles=[0.75,0.9,0.95,0.99])

        email.id        salary
count   5.000000      5.000000
mean    4.800000  53400.000000
std     3.114482  16241.921069
min     2.000000  34000.000000
50%     4.000000  59000.000000
75%     5.000000  60000.000000
90%     8.000000  68400.000000
95%     9.000000  71200.000000
99%     9.800000  73440.000000
max    10.000000  74000.000000